#@ # 
#@ # Running icc2_shell Version O-2018.06-SP1 for linux64 -- Jul 17, 2018
#@ # Date:   Thu Mar  7 01:24:30 2024
#@ # Run by: ICer@IC_EDA
#@ 

gui_set_pref_value -category {SelectByNamePalette} -key {ObjectType} -value {Logical Cells}
set_host_options -max_cores 8
set DESIGN riscv_core
source /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/2-Floorplan/scripts/proc_block.tcl
set dir "/mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/report"
open_block /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/2-Floorplan/scripts/riscv_core:riscv_core_2_floorplan.design
gui_set_pref_value -category {showRelativeLocationConstraints} -key {macroOffsetX} -value {0.001}
gui_set_pref_value -category {showRelativeLocationConstraints} -key {macroOffsetY} -value {0.001}
link_block
win_set_filter -visible -class cell -filter {hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -visible -class placement_blockage -filter {wiring} -layer {0-72}
win_set_filter -expand_cell_types {soft_macro  }
win_set_select_class -visible {cell port bound routing_blockage shaping_blockage pg_region pin_blockage block_shielding topology_node topology_edge core_area die_area edit_group shape via terminal fill_cell placement_blockage }
win_set_filter -class cell -filter {cell_array hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -class placement_blockage -filter {wiring} -layer {0-72}
win_set_select_class {cell port bound routing_blockage shaping_blockage pg_region pin_blockage topology_node topology_edge edit_group shape via placement_blockage }
link_block
####################################################################################
###################################  POWER PLAN  ###################################
####################################################################################
############################
########  PG RINGS  ########
############################
remove_pg_via_master_rules -all
remove_pg_patterns -all
remove_pg_strategies -all
remove_pg_strategy_via_rules -all
create_pg_ring_pattern ring1     -nets VDD             -horizontal_layer {M9} -vertical_layer {M8 }             -horizontal_width 5 -vertical_width 5             -horizontal_spacing 0.8 -vertical_spacing 0.8             -via_rule {{intersection: all}}
set_pg_strategy ring1_s -core -pattern {{name: ring1} {nets: VDD VSS}} -extension {{stop: design_boundary}}
compile_pg -strategies ring1_s
create_pg_ring_pattern ring2     -nets VSS             -horizontal_layer {M7} -vertical_layer {M6}             -horizontal_width 5 -vertical_width 5             -horizontal_spacing 0.8 -vertical_spacing 0.8             -via_rule {{intersection: all}}
set_pg_strategy ring2_s -core -pattern {{name: ring2} {nets: VDD VSS}} -extension {{stop: design_boundary}}
compile_pg -strategies ring2_s
create_pg_mesh_pattern m9_mesh -layers {{{horizontal_layer: M9} {width: 2.5} {spacing: 4} {pitch: 13} {offset: 8}}}
set_pg_strategy m9_mesh -core -extension {{direction: T B L R} {stop: outermost_ring}} -pattern {{name: m9_mesh} {nets: VDD VSS}}
compile_pg -strategies m9_mesh
create_pg_mesh_pattern m8_mesh -layers {{{vertical_layer: M8} {width: 2.5} {spacing: 4} {pitch: 13} {offset: 8}}}
set_pg_strategy m8_mesh -core -extension {{direction: T B L R} {stop: outermost_ring}} -pattern {{name: m8_mesh} {nets: VDD VSS}}
compile_pg -strategies m8_mesh
create_pg_mesh_pattern m7_mesh -layers {{{horizontal_layer: M7} {width: 2.5} {spacing: 4} {pitch: 13} {offset: 8}}}
set_pg_strategy m7_s -core -extension {{direction: T B L R} {stop: outermost_ring}} -pattern {{name: m7_mesh} {nets: VDD VSS}}
compile_pg -strategies m7_s
create_pg_mesh_pattern m6_mesh -layers {{{vertical_layer: M6} {width: 2.5} {spacing: 4} {pitch: 13} {offset: 8}}}
set_pg_strategy m6_s -core -extension {{direction: T B L R} {stop: outermost_ring}} -pattern {{name: m6_mesh} {nets: VDD VSS}}
compile_pg -strategies m6_s
create_pg_mesh_pattern m5_mesh -layers {{{horizontal_layer: M5} {width: 2.5} {spacing: 4} {pitch: 13} {offset: 8}}}
set_pg_strategy m5_s -core -extension {{direction: T B L R} {stop: core_boundary}} -pattern {{name: m5_mesh} {nets: VDD VSS}}
compile_pg -strategies m5_s
create_pg_std_cell_conn_pattern rail_pattern  -rail_width 0.094 -layers {M1}
######### Create rail strategy #########################
set_pg_strategy rail_strat -pattern {{pattern: rail_pattern} {nets: VDD VSS}} -core
######### compile rail #################################
compile_pg -strategies rail_strat
#############  fixing floating vias ###################
remove_via  [get_vias -of_objects [get_nets -all "VSS VDD"]]
create_pg_vias -nets "VSS VDD"
################# design checks ######################
check_pg_connectivity
check_pg_drc
check_pg_missing_vias
######################### saving Design & printing reports #####################
save_block -as ${DESIGN}_3_after_pns
print_res {pns}
report_qor > $dir/pns/qor.rpt
create_utilization_configuration config_sr             -capacity site_row -exclude {hard_macros macro_keepouts}
report_utilization -config config_sr -verbose > $dir/pns/utilization_sire_row.rpt
close_blocks -force -purge
close_lib
set_host_options -max_cores 8
set DESIGN riscv_core
source /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/2-Floorplan/scripts/proc_block.tcl
set dir "/mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/report"
open_block /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/2-Floorplan/scripts/riscv_core:riscv_core_3_after_pns.design
link_block
link_block
####################################################################################
###################################  PLACEMENT  ###################################
####################################################################################
############################################################
#source /home/islam/ICpedia_Tasks/GPCore-aes_ip/core_updated/syn/cons/dont_use_generic.tcl
#set_target_library_subset -dont_use [get_lib_cells */*0P5*]
#set_target_library_subset -dont_use saed14rvt_ss0p6vm40c:SAEDRVT14_INV_4.frame
#set_target_library_subset -dont_use saed14rvt_ss0p6vm40c:SAEDRVT14_EO2_V1_0P75.frame
#set_target_library_subset -dont_use saed14rvt_ss0p6vm40c:SAEDRVT14_OA221_U_0P5.frame
#set_target_library_subset -dont_use saed14rvt_ss0p6vm40c:SAEDRVT14_CAPTTAPP6.frame
#set_target_library_subset -dont_use saed14rvt_ss0p6vm40c:SAEDRVT14_OA21_1.frame
#set_target_library_subset -dont_use saed14rvt_ss0p6vm40c:SAEDRVT14_OAI21_0P5.frame
#set_target_library_subset -dont_use saed14rvt_ss0p6vm40c:SAEDRVT14_MUX2_MM_0P5.frame
#set_target_library_subset -dont_use saed14rvt_ss0p6vm40c:SAEDRVT14_MUX2_MM_0P5.frame
#set_target_library_subset -dont_use saed14rvt_ss0p6vm40c:SAEDRVT14_OA221_U_0P5.frame
#set_app_options #-name opt.common.enable_target_library_subset_opt -value 1
check_design -checks pre_placement_stage
suppress_message -force CMD-013
suppress_message -force CMD-013; report_design_mismatch -check_design >> /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/2-Floorplan/scripts/check_design2024Mar07012844.log
suppress_message -force CMD-013; check_scan_chain >> /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/2-Floorplan/scripts/check_design2024Mar07012844.log
suppress_message -force CMD-013; check_mv_design >> /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/2-Floorplan/scripts/check_design2024Mar07012844.log
suppress_message -force CMD-013; check_rp_constraints >> /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/2-Floorplan/scripts/check_design2024Mar07012844.log
suppress_message -force CMD-013; check_timing >> /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/2-Floorplan/scripts/check_design2024Mar07012844.log
suppress_message -force CMD-013; check_hier_design -stage pre_placement >> /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/2-Floorplan/scripts/check_design2024Mar07012844.log
unsuppress_message CMD-013
analyze_lib_cell_placement -lib_cells *
check_pg_drc
#set_app_options -name place.coarse.congestion_driven_max_util -value 0.6
set_app_options -name time.disable_recovery_removal_checks -value false
set_app_options -name time.disable_case_analysis -value false
set_app_options -name place.coarse.continue_on_missing_scandef -value true
set_app_options -name opt.common.user_instance_name_prefix -value place
#set_app_options -name place.coarse.congestion_layer_aware  -value true
#set_app_options -name place.coarse.increased_cell_expansion  -value true
#set_app_options -name place.coarse.congestion_expansion_direction  -value horizontal.
#remove_corners estimated_corner
create_placement -congestion
legalize_placement
check_pg_drc
analyze_design_violations
place_opt
redirect $::sh_dev_null { set_app_options -name opt.internal.current_block_utilization -value [report_utilization] }














redirect $::sh_dev_null { set_app_options -name opt.internal.current_block_utilization -value [report_utilization] }

redirect $::sh_dev_null { set_app_options -name opt.internal.current_block_utilization -value [report_utilization] }

set_app_options -as_user_default -list {route.global.debug_compact_coef 4}
set_app_options -as_user_default -list {route.global.debug_compact_coef 1}




set_app_options -as_user_default -list {route.global.debug_compact_coef 4}
set_app_options -as_user_default -list {route.global.debug_compact_coef 1}
legalize_placement
check_legality -verbos
report_timing
set NDM_POWER_NET                "VDD" ;#
set NDM_POWER_PORT               "VDD" ;#
set NDM_GROUND_NET               "VSS" ;#
set NDM_GROUND_PORT              "VSS" ;#
#############
create_net -power $NDM_POWER_NET
create_net -ground $NDM_GROUND_NET
connect_pg_net -net $NDM_POWER_NET [get_pins -hierarchical "*/VDD"]
connect_pg_net -net $NDM_GROUND_NET [get_pins -hierarchical "*/VSS"]
#######
save_block -as ${DESIGN}_4_placed
print_res {placement}
report_qor > $dir/placement/qor.rpt
report_utilization -config config_sr -verbose > $dir/placement/utilization_sire_row.rpt
close_blocks -force -purge
close_lib
set_host_options -max_cores 8
set DESIGN riscv_core
source /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/2-Floorplan/scripts/proc_block.tcl
set dir "/mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/report"
open_block /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/2-Floorplan/scripts/riscv_core:riscv_core_4_placed.design
link_block
link_block
####################################################################################
###################################  CTS  ###################################
####################################################################################
set_dont_touch_network -clear [get_clocks CLK_I]
############################################################
#source /home/islam/ICpedia_Tasks/GPCore-aes_ip/core_updated/syn/cons/dont_use_generic.tcl
#create_routing_rule ROUTE_RULES_1  # -widths {M3 0.2 M4 0.2 }   #-spacings {M3 0.42 M4 0.63 }
#set_clock_routing_rules -rules ROUTE_RULES_1 -min_routing_layer M2 -max_routing_layer M4
set_lib_cell_purpose -exclude cts [get_lib_cells -of [get_cells *]]
set_lib_cell_purpose -include cts */*AOBUF_IW*
set_lib_cell_purpose -include cts */*BUF*
check_design -checks pre_clock_tree_stage
suppress_message -force CMD-013
suppress_message -force CMD-013; report_design_mismatch -check_design >> /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/2-Floorplan/scripts/check_design2024Mar07015001.log
suppress_message -force CMD-013; check_scan_chain >> /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/2-Floorplan/scripts/check_design2024Mar07015001.log
suppress_message -force CMD-013; check_mv_design >> /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/2-Floorplan/scripts/check_design2024Mar07015001.log
suppress_message -force CMD-013; check_legality >> /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/2-Floorplan/scripts/check_design2024Mar07015001.log
suppress_message -force CMD-013; design_extraction_check >> /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/2-Floorplan/scripts/check_design2024Mar07015001.log
suppress_message -force CMD-013; check_timing >> /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/2-Floorplan/scripts/check_design2024Mar07015001.log
suppress_message -force CMD-013; check_clock_trees >> /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/2-Floorplan/scripts/check_design2024Mar07015001.log
suppress_message -force CMD-013; check_hier_design -stage pre_clock_tree >> /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/2-Floorplan/scripts/check_design2024Mar07015001.log
unsuppress_message CMD-013
create_routing_rule ROUTE_RULES_1 -multiplier_spacing 3 -multiplier_width 3
set_clock_routing_rules -rules ROUTE_RULES_1 -min_routing_layer metal2  -max_routing_layer metal5
set_clock_tree_options -target_latency 0.000 -target_skew 0.000
set cts_enable_drc_fixing_on_data true
clock_opt
synthesize_clock_trees
redirect $::sh_dev_null { set_app_options -name opt.internal.current_block_utilization -value [report_utilization] }

set_app_options -as_user_default -list {route.global.global_route_topology_style 1}
route_group -all_clock_nets -reuse_existing_global_route true
set_app_options -as_user_default -list {route.global.global_route_topology_style 0}

redirect $::sh_dev_null { set_app_options -name opt.internal.current_block_utilization -value [report_utilization] }

redirect $::sh_dev_null { set_app_options -name opt.internal.current_block_utilization -value [report_utilization] }


set_app_options -as_user_default -list {route.global.debug_compact_coef 4}
set_app_options -as_user_default -list {route.global.debug_compact_coef 1}


set_app_options -as_user_default -list {route.global.debug_compact_coef 4}
set_app_options -as_user_default -list {route.global.debug_compact_coef 1}


set_app_options -as_user_default -list {route.global.debug_compact_coef 4}
set_app_options -as_user_default -list {route.global.debug_compact_coef 1}
route_group -all_clock_nets
check_pg_drc
clock_opt
synthesize_clock_trees
redirect $::sh_dev_null { set_app_options -name opt.internal.current_block_utilization -value [report_utilization] }

set_app_options -as_user_default -list {route.global.global_route_topology_style 1}
route_group -all_clock_nets -reuse_existing_global_route true
set_app_options -as_user_default -list {route.global.global_route_topology_style 0}

redirect $::sh_dev_null { set_app_options -name opt.internal.current_block_utilization -value [report_utilization] }

redirect $::sh_dev_null { set_app_options -name opt.internal.current_block_utilization -value [report_utilization] }


set_app_options -as_user_default -list {route.global.debug_compact_coef 4}
set_app_options -as_user_default -list {route.global.debug_compact_coef 1}


set_app_options -as_user_default -list {route.global.debug_compact_coef 4}
set_app_options -as_user_default -list {route.global.debug_compact_coef 1}


set_app_options -as_user_default -list {route.global.debug_compact_coef 4}
set_app_options -as_user_default -list {route.global.debug_compact_coef 1}
route_group -all_clock_nets
check_pg_drc
clock_opt
synthesize_clock_trees
redirect $::sh_dev_null { set_app_options -name opt.internal.current_block_utilization -value [report_utilization] }

set_app_options -as_user_default -list {route.global.global_route_topology_style 1}
route_group -all_clock_nets -reuse_existing_global_route true
set_app_options -as_user_default -list {route.global.global_route_topology_style 0}

redirect $::sh_dev_null { set_app_options -name opt.internal.current_block_utilization -value [report_utilization] }

redirect $::sh_dev_null { set_app_options -name opt.internal.current_block_utilization -value [report_utilization] }


set_app_options -as_user_default -list {route.global.debug_compact_coef 4}
set_app_options -as_user_default -list {route.global.debug_compact_coef 1}


set_app_options -as_user_default -list {route.global.debug_compact_coef 4}
set_app_options -as_user_default -list {route.global.debug_compact_coef 1}


set_app_options -as_user_default -list {route.global.debug_compact_coef 4}
set_app_options -as_user_default -list {route.global.debug_compact_coef 1}
route_group -all_clock_nets
check_pg_drc
clock_opt -from final_opto

redirect $::sh_dev_null { set_app_options -name opt.internal.current_block_utilization -value [report_utilization] }

redirect $::sh_dev_null { set_app_options -name opt.internal.current_block_utilization -value [report_utilization] }


set_app_options -as_user_default -list {route.global.debug_compact_coef 4}
set_app_options -as_user_default -list {route.global.debug_compact_coef 1}


set_app_options -as_user_default -list {route.global.debug_compact_coef 4}
set_app_options -as_user_default -list {route.global.debug_compact_coef 1}


set_app_options -as_user_default -list {route.global.debug_compact_coef 4}
set_app_options -as_user_default -list {route.global.debug_compact_coef 1}
route_group -all_clock_nets
check_pg_drc
gui_show_error_data
gui_set_error_browser_option -show_mode all
gui_set_error_browser_option -view_mode zoom
gui_set_error_browser_option -zoom_factor 1.000000
gui_set_error_browser_option -grouping type
gui_error_browser -show
gui_open_error_data -name {DRC_report_by_check_pg_drc}
gui_set_current_errors -data_name {DRC_report_by_check_pg_drc} -group {Metal Spacing}
gui_set_selected_errors -replace [gui_get_errors -data_name {DRC_report_by_check_pg_drc} -id {0}] -force
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showPin -value true
win_set_select_class -visible {cell pin port bound routing_blockage shaping_blockage pg_region pin_blockage block_shielding topology_node topology_edge core_area die_area edit_group shape via terminal fill_cell placement_blockage }
win_set_select_class {cell pin port bound routing_blockage shaping_blockage pg_region pin_blockage topology_node topology_edge edit_group shape via placement_blockage }
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_NWELL -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_LVTIMP -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_PO -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M1 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M1DMY -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_VIA1 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M2 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M2DMY -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_VIA2 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M3 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M3DMY -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_VIA3 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M4 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M4DMY -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_VIA4 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M5 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M5DMY -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_VIA5 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M6 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M6DMY -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_VIA6 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M7 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M7DMY -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_VIA7 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M8 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M8DMY -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_VIA8 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M9 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M9DMY -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_VIARDL -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_MRDL -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_DIFF -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_BJTDMY -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_CPO -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_CTM1 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_DIFF_15 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_DIFF_25 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_DIOD -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_DNW -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_ESD -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_FIN -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_HOTNWL -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_HVTIMP -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_IP -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_LOGO -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M1PIN -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M2PIN -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M3PIN -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M4PIN -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M5PIN -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M6PIN -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M7PIN -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M8PIN -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_M9PIN -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_MRPIN -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_NIMP -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_PAD -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_PIMP -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_RM1 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_RM2 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_RM3 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_RM4 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_RM5 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_RM6 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_RM7 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_RM8 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_RM9 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_RMARK -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_RNW -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_SBLK -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_VIA0 -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_prBoundary -value false
gui_set_setting -window [gui_get_current_window -types Layout -mru] -setting showLayer_UNASSIGNED -value false
gui_set_layout_layer_visibility -toggle [get_layers -filter {mask_name == metal1} -quiet]
win_set_filter -visible -class pin -filter {} -layer {0-2 4-72}
win_set_filter -visible -class routing_blockage -layer {0-2 4-72}
win_set_filter -visible -class shape -filter {} -layer {0-2 4-72}
win_set_filter -visible -class via -filter {} -layer {0-2 4-72}
win_set_filter -visible -class terminal -filter {}  -layer {0-2 4-72}
win_set_filter -class pin -filter {} -layer {0-2 4-72}
win_set_filter -class routing_blockage -layer {0-2 4-72}
win_set_filter -class shape -filter {} -layer {0-2 4-72}
win_set_filter -class via -filter {} -layer {0-2 4-72}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {97.849 50.311}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {97.849 50.311}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {97.848 50.312}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {97.849 50.311}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {98.065 50.360}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {98.064 50.361}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {97.818 50.628}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {97.820 50.630}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {97.821 50.628}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {97.944 50.477}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {97.943 50.477}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {98.055 50.708}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {98.036 50.709}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {97.188 51.886}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {97.191 51.897}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {96.991 51.997}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {96.988 51.995}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {96.985 51.994}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {96.972 51.984}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {96.990 51.973}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {97.042 51.932}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {96.924 51.815}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {96.924 52.050}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {127.037 161.678}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {141.623 70.870}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {141.623 71.105}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {139.976 72.046}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {139.989 72.053}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {141.468 74.586}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {141.494 74.621}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {141.408 74.401}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {141.407 74.402}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {141.234 74.401}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {141.234 74.402}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {141.232 74.400}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {141.225 74.394}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {141.225 74.395}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {141.227 74.395}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {141.249 74.409}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {141.251 74.409}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {141.252 74.412}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {141.258 74.408}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {141.235 74.346}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {141.246 74.353}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {141.270 74.399}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {141.387 74.399}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {116.686 137.682}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {92.219 40.287}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 2 -at_point {92.219 40.287}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {106.805 52.520}
gui_zoom -window [gui_get_current_window -types Layout -view] -factor 0.5 -at_point {106.805 52.520}
write_verilog /mnt/hgfs/Gp_CV32e40p/ASIC-Implementauion-of-CV32E40S-RISC-V-core-/results/${DESIGN}.cts.gate.v
set_propagated_clock [get_clocks CLK_GATED]
#create_tap_cells -lib_cell saed14rvt_frame_timing_ccs/SAEDRVT14_TAPDS -pattern stagger -distance 15
save_block -as ${DESIGN}_5_cts
print_res {cts}
report_qor > $dir/cts/qor.rpt
create_utilization_configuration config_sr             -capacity site_row -exclude {hard_macros macro_keepouts}
report_utilization -config config_sr -verbose > $dir/cts/utilization.rpt
report_clock_timing  -type skew >  $dir/cts/clock_skew.rpt
save_block riscv_core:riscv_core_4_placed
close_blocks -force -purge
gui_clear_selected_errors
close_lib
